20-rails-review/alien-adoptions/app/controllers/cows_controller.rb

SELECT "cows"."id" FROM "cows"
---
  def index
    @cows = Cow.all

SELECT "aliens".* FROM "aliens"
---
  def new
    @cow = Cow.new
    @aliens = Alien.all

INSERT INTO "cows" ("name", "number_of_spots", "age", "created_at", "updated_at", "alien_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Bill 3"], ["number_of_spots", 8], ["age", 8], ["created_at", "2019-11-22 15:02:25.976828"], ["updated_at", "2019-11-22 15:02:25.976828"], ["alien_id", 37]]
---
  def create
    cow = Cow.new(cow_params)

    if cow.save

SELECT "cows".* FROM "cows" WHERE "cows"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
---
  def show
    @cow = Cow.find(params[:id])

SELECT "cows".* FROM "cows" WHERE "cows"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
  def edit
    @cow = Cow.find(params[:id])

SELECT "cows".* FROM "cows" WHERE "cows"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]
UPDATE "cows" SET "number_of_spots" = ?, "updated_at" = ? WHERE "cows"."id" = ?  [["number_of_spots", 88], ["updated_at", "2019-11-21 20:15:19.059427"], ["id", 42]]
---
  def update
    cow = Cow.find(params[:id])
    cow.update(cow_params)

SELECT "cows".* FROM "cows" WHERE "cows"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
DELETE FROM "cows" WHERE "cows"."id" = ?  [["id", 20]]
---
  def delete
    cow = Cow.find(params[:id])
    cow.destroy