17-rails-routes-forms-and-params/alien-adoptions/app/controllers/cows_controller.rb

SELECT "cows".* FROM "cows"
---
  def index
    @cows = Cow.all

INSERT INTO "cows" ("name", "number_of_spots", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Jack"], ["number_of_spots", 88], ["age", 9], ["created_at", "2019-11-20 20:37:40.739986"], ["updated_at", "2019-11-20 20:37:40.739986"]]
---
  def create
    byebug
    cow = Cow.create(cow_params)