30-rails-api/christmas-album-api/app/controllers/api/v1/albums_controller.rb

  def index
    albums = Album.all
---
SELECT "albums".* FROM "albums"

  def create
    album = Album.create(album_params)
---
INSERT INTO "albums" ("title", "artist", "image", "score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"